{"class_name": "Functional", "config": {"name": "cae", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [1, 8, 8, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "Wafer"}, "registered_name": null, "name": "Wafer", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [1, 8], "dtype": "float32", "sparse": false, "ragged": false, "name": "Cond"}, "registered_name": null, "name": "Cond", "inbound_nodes": []}, {"module": "keras.src.engine.functional", "class_name": "Functional", "config": {"name": "encoder", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [1, 8, 8, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "Wafer"}, "registered_name": null, "name": "Wafer", "inbound_nodes": []}, {"module": "qkeras.qlayers", "class_name": "QActivation", "config": {"name": "input_quantization", "trainable": true, "dtype": "float32", "activation": {"module": "qkeras.quantizers", "class_name": "quantized_bits", "config": {"bits": 8, "integer": 1, "symmetric": 0, "alpha": null, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "registered_name": "quantized_bits"}}, "registered_name": "QActivation", "build_config": {"input_shape": [1, 8, 8, 1]}, "name": "input_quantization", "inbound_nodes": [[["Wafer", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.pad_2", "trainable": true, "dtype": "float32", "function": "compat.v1.pad"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [1, 8, 8, 1]}, "name": "tf.compat.v1.pad_2", "inbound_nodes": [["input_quantization", 0, 0, {"paddings": [[0, 0], [0, 1], [0, 1], [0, 0]], "mode": "CONSTANT", "name": null, "constant_values": 0}]]}, {"module": "qkeras.qconvolutional", "class_name": "QConv2D", "config": {"name": "conv2d", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "qkeras.qlayers", "class_name": "QInitializer", "config": {"initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "use_scale": true, "quantizer": {"module": "qkeras.quantizers", "class_name": "quantized_bits", "config": {"bits": 6, "integer": 0, "symmetric": 0, "alpha": 1, "keep_negative": 1, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "registered_name": "quantized_bits"}}, "registered_name": "QInitializer"}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"module": "qkeras.qlayers", "class_name": "Clip", "config": {"min_value": -1, "max_value": 1}, "registered_name": "Clip"}, "bias_constraint": {"module": "qkeras.qlayers", "class_name": "Clip", "config": {"min_value": -1, "max_value": 1}, "registered_name": "Clip"}, "kernel_quantizer": {"module": "qkeras.quantizers", "class_name": "quantized_bits", "config": {"bits": 6, "integer": 0, "symmetric": 0, "alpha": 1, "keep_negative": 1, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "registered_name": "quantized_bits"}, "bias_quantizer": {"module": "qkeras.quantizers", "class_name": "quantized_bits", "config": {"bits": 6, "integer": 0, "symmetric": 0, "alpha": 1, "keep_negative": 1, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "registered_name": "quantized_bits"}, "kernel_range": null, "bias_range": null}, "registered_name": "QConv2D", "build_config": {"input_shape": [1, 9, 9, 1]}, "name": "conv2d", "inbound_nodes": [[["tf.compat.v1.pad_2", 0, 0, {}]]]}, {"module": "qkeras.qlayers", "class_name": "QActivation", "config": {"name": "act", "trainable": true, "dtype": "float32", "activation": {"module": "qkeras.quantizers", "class_name": "quantized_bits", "config": {"bits": 8, "integer": 1, "symmetric": 0, "alpha": null, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "registered_name": "quantized_bits"}}, "registered_name": "QActivation", "build_config": {"input_shape": [1, 4, 4, 8]}, "name": "act", "inbound_nodes": [[["conv2d", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [1, 4, 4, 8]}, "name": "flatten_2", "inbound_nodes": [[["act", 0, 0, {}]]]}, {"module": "qkeras.qlayers", "class_name": "QDense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 16, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "qkeras.qlayers", "class_name": "QInitializer", "config": {"initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "use_scale": true, "quantizer": {"module": "qkeras.quantizers", "class_name": "quantized_bits", "config": {"bits": 6, "integer": 0, "symmetric": 0, "alpha": 1, "keep_negative": 1, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "registered_name": "quantized_bits"}}, "registered_name": "QInitializer"}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"module": "qkeras.qlayers", "class_name": "Clip", "config": {"min_value": -1, "max_value": 1}, "registered_name": "Clip"}, "bias_constraint": {"module": "qkeras.qlayers", "class_name": "Clip", "config": {"min_value": -1, "max_value": 1}, "registered_name": "Clip"}, "kernel_quantizer": {"module": "qkeras.quantizers", "class_name": "quantized_bits", "config": {"bits": 6, "integer": 0, "symmetric": 0, "alpha": 1, "keep_negative": 1, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "registered_name": "quantized_bits"}, "bias_quantizer": {"module": "qkeras.quantizers", "class_name": "quantized_bits", "config": {"bits": 6, "integer": 0, "symmetric": 0, "alpha": 1, "keep_negative": 1, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "registered_name": "quantized_bits"}, "kernel_range": null, "bias_range": null}, "registered_name": "QDense", "build_config": {"input_shape": [1, 128]}, "name": "dense", "inbound_nodes": [[["flatten_2", 0, 0, {}]]]}, {"module": "qkeras.qlayers", "class_name": "QActivation", "config": {"name": "latent_quantization", "trainable": true, "dtype": "float32", "activation": {"module": "qkeras.quantizers", "class_name": "quantized_bits", "config": {"bits": 9, "integer": 1, "symmetric": 0, "alpha": null, "keep_negative": true, "use_stochastic_rounding": false, "qnoise_factor": 1.0}, "registered_name": "quantized_bits"}}, "registered_name": "QActivation", "build_config": {"input_shape": [1, 16]}, "name": "latent_quantization", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [1, 8], "dtype": "float32", "sparse": false, "ragged": false, "name": "Cond"}, "registered_name": null, "name": "Cond", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "dtype": "float32", "axis": 1}, "registered_name": null, "build_config": {"input_shape": [[1, 16], [1, 8]]}, "name": "concatenate_2", "inbound_nodes": [[["latent_quantization", 0, 0, {}], ["Cond", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_2", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [1, 24]}, "name": "tf.math.multiply_2", "inbound_nodes": [["concatenate_2", 0, 0, {"y": 64, "name": null}]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.math.floor_2", "trainable": true, "dtype": "float32", "function": "math.floor"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [1, 24]}, "name": "tf.math.floor_2", "inbound_nodes": [["tf.math.multiply_2", 0, 0, {}]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.math.truediv_2", "trainable": true, "dtype": "float32", "function": "math.truediv"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [1, 24]}, "name": "tf.math.truediv_2", "inbound_nodes": [["tf.math.floor_2", 0, 0, {"y": 64, "name": null}]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.math.minimum_2", "trainable": true, "dtype": "float32", "function": "math.minimum"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [1, 24]}, "name": "tf.math.minimum_2", "inbound_nodes": [["tf.math.truediv_2", 0, 0, {"y": 1.984375, "name": null}]]}], "input_layers": [["Wafer", 0, 0], ["Cond", 0, 0]], "output_layers": [["tf.math.minimum_2", 0, 0]]}, "registered_name": "Functional", "build_config": {"input_shape": [[1, 8, 8, 1], [1, 8]]}, "name": "encoder", "inbound_nodes": [[["Wafer", 0, 0, {}], ["Cond", 0, 0, {}]]]}, {"module": "keras.src.engine.functional", "class_name": "Functional", "config": {"name": "decoder", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [1, 24], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_3"}, "registered_name": null, "name": "input_3", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_6", "trainable": true, "dtype": "float32", "units": 24, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [1, 24]}, "name": "dense_6", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_8", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [1, 24]}, "name": "re_lu_8", "inbound_nodes": [[["dense_6", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [1, 24]}, "name": "dense_7", "inbound_nodes": [[["re_lu_8", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_9", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [1, 64]}, "name": "re_lu_9", "inbound_nodes": [[["dense_7", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_8", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [1, 64]}, "name": "dense_8", "inbound_nodes": [[["re_lu_9", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_10", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [1, 128]}, "name": "re_lu_10", "inbound_nodes": [[["dense_8", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Reshape", "config": {"name": "reshape_2", "trainable": true, "dtype": "float32", "target_shape": [4, 4, 8]}, "registered_name": null, "build_config": {"input_shape": [1, 128]}, "name": "reshape_2", "inbound_nodes": [[["re_lu_10", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_2", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "registered_name": null, "build_config": {"input_shape": [1, 4, 4, 8]}, "name": "conv2d_transpose_2", "inbound_nodes": [[["reshape_2", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_2", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "registered_name": "SlicingOpLambda", "build_config": {"input_shape": [1, 9, 9, 1]}, "name": "tf.__operators__.getitem_2", "inbound_nodes": [["conv2d_transpose_2", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 0, "stop": 8, "step": null}, {"start": 0, "stop": 8, "step": null}]}]]}, {"module": "keras.layers", "class_name": "ReLU", "config": {"name": "re_lu_11", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "registered_name": null, "build_config": {"input_shape": [1, 8, 8, 1]}, "name": "re_lu_11", "inbound_nodes": [[["tf.__operators__.getitem_2", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0]], "output_layers": [["re_lu_11", 0, 0]]}, "registered_name": "Functional", "build_config": {"input_shape": [1, 24]}, "name": "decoder", "inbound_nodes": [[["encoder", 1, 0, {}]]]}], "input_layers": [["Wafer", 0, 0], ["Cond", 0, 0]], "output_layers": [["decoder", 1, 0]]}, "keras_version": "2.13.1", "backend": "tensorflow"}